.emacs.d/org/work.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>work</title>
<!-- 2016-02-17 Ср 13:21 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="U-кме\ку" />
</head>
<body>
<div id="content">
<h1 class="title">work</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. <span class="done DONE">DONE</span> Meeting<sub>1</sub>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="MEETING">MEETING</span></span></a>
<ul>
<li><a href="#sec-1-1">1.1. Team work</a>
<ul>
<li><a href="#sec-1-1-1">1.1.1. New field in database</a></li>
<li><a href="#sec-1-1-2">1.1.2. <span class="done DONE">DONE</span> About pull requests</a></li>
<li><a href="#sec-1-1-3">1.1.3. Tree</a></li>
</ul>
</li>
<li><a href="#sec-1-2">1.2. Personal work</a></li>
<li><a href="#sec-1-3">1.3. <span class="done DONE">DONE</span> Priorities</a>
<ul>
<li><a href="#sec-1-3-1">1.3.1. <span class="todo TODO">TODO</span> Create promo with default target</a></li>
<li><a href="#sec-1-3-2">1.3.2. <span class="done DONE">DONE</span> Check device filter</a></li>
<li><a href="#sec-1-3-3">1.3.3. <span class="done DONE">DONE</span> Work with check target statuses</a></li>
<li><a href="#sec-1-3-4">1.3.4. <span class="todo TODO">TODO</span> Authentification</a></li>
<li><a href="#sec-1-3-5">1.3.5. <span class="done IN_PROGRESS">IN PROGRESS</span> Bugs</a></li>
<li><a href="#sec-1-3-6">1.3.6. <span class="todo TODO">TODO</span> Versions</a></li>
</ul>
</li>
<li><a href="#sec-1-4">1.4. <span class="done DONE">DONE</span> Front-end</a></li>
</ul>
</li>
<li><a href="#sec-2">2. <span class="done DONE">DONE</span> Meeting<sub>2</sub>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="MEETING">MEETING</span></span></a>
<ul>
<li><a href="#sec-2-1">2.1. Authorization</a></li>
<li><a href="#sec-2-2">2.2. Dumb server</a></li>
<li><a href="#sec-2-3">2.3. Check target</a></li>
<li><a href="#sec-2-4">2.4. Rework target and promo encodings</a></li>
</ul>
</li>
<li><a href="#sec-3">3. <span class="todo TODO">TODO</span> </a>
<ul>
<li><a href="#sec-3-1">3.1. Bug list&#xa0;&#xa0;&#xa0;<span class="tag"><span class="BUG">BUG</span></span></a></li>
<li><a href="#sec-3-2">3.2. Promo creation bug&#xa0;&#xa0;&#xa0;<span class="tag"><span class="BUG">BUG</span></span></a></li>
<li><a href="#sec-3-3">3.3. <span class="done CANCELLED">CANCELLED</span> New target not visible on create&#xa0;&#xa0;&#xa0;<span class="tag"><span class="BUG">BUG</span></span></a></li>
<li><a href="#sec-3-4">3.4. <span class="done DONE">DONE</span> Edit target does not adds switch(On/Off)At fields&#xa0;&#xa0;&#xa0;<span class="tag"><span class="BUG">BUG</span></span></a></li>
<li><a href="#sec-3-5">3.5. <span class="done DONE">DONE</span> Set target status&#xa0;&#xa0;&#xa0;<span class="tag"><span class="BUG">BUG</span></span></a></li>
<li><a href="#sec-3-6">3.6. <span class="done IN_PROGRESS">IN PROGRESS</span> New target does not displayed&#xa0;&#xa0;&#xa0;<span class="tag"><span class="BUG">BUG</span></span></a></li>
<li><a href="#sec-3-7">3.7. <span class="done DONE">DONE</span> New target check status&#xa0;&#xa0;&#xa0;<span class="tag"><span class="BUG">BUG</span></span></a></li>
<li><a href="#sec-3-8">3.8. <span class="done CANCELLED">CANCELLED</span> Not enough filters in check target&#xa0;&#xa0;&#xa0;<span class="tag"><span class="BUG">BUG</span></span></a></li>
<li><a href="#sec-3-9">3.9. Null target&#xa0;&#xa0;&#xa0;<span class="tag"><span class="BUG">BUG</span></span></a></li>
<li><a href="#sec-3-10">3.10. <span class="todo WAITING">WAITING</span> Equals target check statuses&#xa0;&#xa0;&#xa0;<span class="tag"><span class="BUG">BUG</span></span></a>
<ul>
<li><a href="#sec-3-10-1">3.10.1. <span class="done DONE">DONE</span> Fix edit target event</a></li>
<li><a href="#sec-3-10-2">3.10.2. <span class="todo TODO">TODO</span> Check target on create</a></li>
</ul>
</li>
<li><a href="#sec-3-11">3.11. Add version field&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TASK">TASK</span></span></a></li>
<li><a href="#sec-3-12">3.12. <span class="done IN_PROGRESS">IN PROGRESS</span> Split view and BL in feature/check-target&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TASK">TASK</span></span></a></li>
<li><a href="#sec-3-13">3.13. Encode promo and target&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TASK">TASK</span></span></a></li>
<li><a href="#sec-3-14">3.14. Authentification&#xa0;&#xa0;&#xa0;<span class="tag"><span class="FEATURE">FEATURE</span></span></a></li>
<li><a href="#sec-3-15">3.15. Add switch(On/Off)At front implementation&#xa0;&#xa0;&#xa0;<span class="tag"><span class="FEATURE">FEATURE</span></span></a></li>
<li><a href="#sec-3-16">3.16. Default target&#xa0;&#xa0;&#xa0;<span class="tag"><span class="FEATURE">FEATURE</span></span></a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> <span class="done DONE">DONE</span> Meeting<sub>1</sub>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="MEETING">MEETING</span></span></h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Team work</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Discuss about problems in team, cooperation, task delegation.
</p>
</div>
<div id="outline-container-sec-1-1-1" class="outline-4">
<h4 id="sec-1-1-1"><span class="section-number-4">1.1.1</span> New field in database</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
We constantly adding new fields in database, and change its structure. 
May be we can add an structure that will contain all service fields?
</p>

<div class="org-src-container">

<pre class="src src-js">{
  "promo": &lt;url&gt;,
  "target": &lt;url&gt;,
  "filters": {
    "User-Agent": &lt;value&gt;,
    "User-Domain": &lt;value&gt;
  }
  "service": {
    "switchOnAt": &lt;date&gt;,
    "lastTimeChecked": &lt;date&gt;
  }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-1-2" class="outline-4">
<h4 id="sec-1-1-2"><span class="section-number-4">1.1.2</span> <span class="done DONE">DONE</span> About pull requests</h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
Two features peding approval. We need to merge them as soon as possible.
</p>
</div>
</div>

<div id="outline-container-sec-1-1-3" class="outline-4">
<h4 id="sec-1-1-3"><span class="section-number-4">1.1.3</span> Tree</h4>
<div class="outline-text-4" id="text-1-1-3">
<p>
We hugely need tree implemetation to replace LinkProcessor class due LinkProcessor's delopment overhead.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Personal work</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Some questions about front-end and current tasks.
</p>
</div>

<ol class="org-ol"><li><a id="sec-1-2-0-1" name="sec-1-2-0-1"></a>"Check target button" feature<br  /><div class="outline-text-5" id="text-1-2-0-1">
<p>
Now "check target" action does not save the state of the target. 
</p>
<ul class="org-ul">
<li>DONE Do we need to implement this functionality now?
</li>
<li>DONE What about availability logic? Do we need to implement it on server, or client?
<p>
Send status to front, like: WARNING, ERROR, GOOD
{
  STATUS,
  DATE,
  MESSAGE
}
</p>
</li>
</ul>
</div>
</li>

<li><a id="sec-1-2-0-2" name="sec-1-2-0-2"></a>CANCELED How about to implement filters by target status?<br  /><div class="outline-text-5" id="text-1-2-0-2">
</div>
</li></ol>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> <span class="done DONE">DONE</span> Priorities</h3>
<div class="outline-text-3" id="text-1-3">
<p>
What tasks have highest priority?
</p>
</div>
<div id="outline-container-sec-1-3-1" class="outline-4">
<h4 id="sec-1-3-1"><span class="section-number-4">1.3.1</span> <span class="todo TODO">TODO</span> Create promo with default target</h4>
<div class="outline-text-4" id="text-1-3-1">
<p>
Add default filters, like "other"
ASSIGNED TO Vladimir
</p>
</div>
</div>
<div id="outline-container-sec-1-3-2" class="outline-4">
<h4 id="sec-1-3-2"><span class="section-number-4">1.3.2</span> <span class="done DONE">DONE</span> Check device filter</h4>
<div class="outline-text-4" id="text-1-3-2">
<p>
Is it in develop branch?
</p>
</div>
</div>
<div id="outline-container-sec-1-3-3" class="outline-4">
<h4 id="sec-1-3-3"><span class="section-number-4">1.3.3</span> <span class="done DONE">DONE</span> Work with check target statuses</h4>
<div class="outline-text-4" id="text-1-3-3">
<p>
Add status to basy, async
Add date to fron
</p>
</div>
</div>
<div id="outline-container-sec-1-3-4" class="outline-4">
<h4 id="sec-1-3-4"><span class="section-number-4">1.3.4</span> <span class="todo TODO">TODO</span> Authentification</h4>
<div class="outline-text-4" id="text-1-3-4">
<p>
NGINX
Merged to smartactors?
[[<a href="mailto:ahvetskovich@gmail.com][about-auth">mailto:ahvetskovich@gmail.com][about-auth</a>]
</p>
</div>
</div>

<div id="outline-container-sec-1-3-5" class="outline-4">
<h4 id="sec-1-3-5"><span class="section-number-4">1.3.5</span> <span class="done IN_PROGRESS">IN PROGRESS</span> Bugs</h4>
</div>
<div id="outline-container-sec-1-3-6" class="outline-4">
<h4 id="sec-1-3-6"><span class="section-number-4">1.3.6</span> <span class="todo TODO">TODO</span> Versions</h4>
</div>
</div>
<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> <span class="done DONE">DONE</span> Front-end</h3>
<div class="outline-text-3" id="text-1-4">
<p>
What frond-end feautures we need? 
</p>

<ul class="org-ul">
<li>When promo created, create new target.
</li>
<li>Filters bug
</li>
<li>Target status
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> <span class="done DONE">DONE</span> Meeting<sub>2</sub>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="MEETING">MEETING</span></span></h2>
<div class="outline-text-2" id="text-2">
</div>

<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Authorization</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Already done in lottery
</p>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Dumb server</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Server stop working while 'check target' process in progress.
</p>
<ul class="org-ul">
<li>Debug
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> Check target</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Async check target button work.
</p>
</div>
</div>

<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> Rework target and promo encodings</h3>
<div class="outline-text-3" id="text-2-4">
<p>
Validate promos and targets.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> <span class="todo TODO">TODO</span> </h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Bug list&#xa0;&#xa0;&#xa0;<span class="tag"><span class="BUG">BUG</span></span></h3>
<div class="outline-text-3" id="text-3-1">
<p>
List of found bugs is available in googledocs.
</p>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Promo creation bug&#xa0;&#xa0;&#xa0;<span class="tag"><span class="BUG">BUG</span></span></h3>
<div class="outline-text-3" id="text-3-2">
<p>
On create promo empty target already exists on frontend.
This bug about reduce operation on front.
</p>
</div>
</div>

<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> <span class="done CANCELLED">CANCELLED</span> New target not visible on create&#xa0;&#xa0;&#xa0;<span class="tag"><span class="BUG">BUG</span></span></h3>
<div class="outline-text-3" id="text-3-3">
<ul class="org-ul">
<li>State "CANCELLED"  from ""           <span class="timestamp-wrapper"><span class="timestamp">[2016-02-16 Вт. 19:14]</span></span> <br  />
     Cause of duplication
</li>
</ul>
<p>
Rare bug? While create new target, this target does not appears in admin
panel.
</p>
<ul class="org-ul">
<li>or when an target previously deleted?
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> <span class="done DONE">DONE</span> Edit target does not adds switch(On/Off)At fields&#xa0;&#xa0;&#xa0;<span class="tag"><span class="BUG">BUG</span></span></h3>
<div class="outline-text-3" id="text-3-4">
<p>
When you trying to edit target url, the time fields does not injects. So, the 'check target' does not work for
corrupted targets.
</p>
</div>
</div>

<div id="outline-container-sec-3-5" class="outline-3">
<h3 id="sec-3-5"><span class="section-number-3">3.5</span> <span class="done DONE">DONE</span> Set target status&#xa0;&#xa0;&#xa0;<span class="tag"><span class="BUG">BUG</span></span></h3>
<div class="outline-text-3" id="text-3-5">
<p>
Throws 'Can not read property', and stops execution, so if some targets is not colored yet, they don't wan't to be
colored.
</p>
</div>
</div>

<div id="outline-container-sec-3-6" class="outline-3">
<h3 id="sec-3-6"><span class="section-number-3">3.6</span> <span class="done IN_PROGRESS">IN PROGRESS</span> New target does not displayed&#xa0;&#xa0;&#xa0;<span class="tag"><span class="BUG">BUG</span></span></h3>
<div class="outline-text-3" id="text-3-6">
<p>
Rare bug? Recently added target does not displayed. Apprears on more then 3 targets? Cause of long database save?
</p>
</div>
</div>

<div id="outline-container-sec-3-7" class="outline-3">
<h3 id="sec-3-7"><span class="section-number-3">3.7</span> <span class="done DONE">DONE</span> New target check status&#xa0;&#xa0;&#xa0;<span class="tag"><span class="BUG">BUG</span></span></h3>
<div class="outline-text-3" id="text-3-7">
<p>
HTTP status doen't checked for newly created targets.
</p>
</div>
</div>

<div id="outline-container-sec-3-8" class="outline-3">
<h3 id="sec-3-8"><span class="section-number-3">3.8</span> <span class="done CANCELLED">CANCELLED</span> Not enough filters in check target&#xa0;&#xa0;&#xa0;<span class="tag"><span class="BUG">BUG</span></span></h3>
<div class="outline-text-3" id="text-3-8">
<ul class="org-ul">
<li>State "CANCELLED"  from ""           <span class="timestamp-wrapper"><span class="timestamp">[2016-02-15 Пн. 18:57]</span></span>
</li>
</ul>
<p>
Check target map does not use enough filters while trying to search and target. So, it can be two equal targets with different filters and that sutiation can corrupt search result.
</p>
</div>
</div>

<div id="outline-container-sec-3-9" class="outline-3">
<h3 id="sec-3-9"><span class="section-number-3">3.9</span> Null target&#xa0;&#xa0;&#xa0;<span class="tag"><span class="BUG">BUG</span></span></h3>
<div class="outline-text-3" id="text-3-9">
<p>
Null targets does not allowed.
To fix try to add <a href="#sec-3-16">default target</a>
</p>
</div>
</div>

<div id="outline-container-sec-3-10" class="outline-3">
<h3 id="sec-3-10"><span class="section-number-3">3.10</span> <span class="todo WAITING">WAITING</span> Equals target check statuses&#xa0;&#xa0;&#xa0;<span class="tag"><span class="BUG">BUG</span></span></h3>
<div class="outline-text-3" id="text-3-10">
<ul class="org-ul">
<li>State "WAITING"    from "IN PROGRESS"       <span class="timestamp-wrapper"><span class="timestamp">[2016-02-16 Вт. 19:15]</span></span> <br  />
     Wait for decision about injecting ids into database record
</li>
</ul>
<p>
'Check target' does't work correctly with equals targets, cause of database 
search query. This problem refers to "Not enough filters in check target" bug.
</p>
</div>

<div id="outline-container-sec-3-10-1" class="outline-4">
<h4 id="sec-3-10-1"><span class="section-number-4">3.10.1</span> <span class="done DONE">DONE</span> Fix edit target event</h4>
<div class="outline-text-4" id="text-3-10-1">
<p>
So when we edit target the message with HTTP status should disappers.
</p>
</div>
</div>

<div id="outline-container-sec-3-10-2" class="outline-4">
<h4 id="sec-3-10-2"><span class="section-number-4">3.10.2</span> <span class="todo TODO">TODO</span> Check target on create</h4>
<div class="outline-text-4" id="text-3-10-2">
<p>
Server does not checks targets on 'target create' action.
</p>

<ul class="org-ul">
<li>So as 'check target' depends on id, that does not exists after creation, front send null id, then, after querying url id saves 'with query result'.
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-3-11" class="outline-3">
<h3 id="sec-3-11"><span class="section-number-3">3.11</span> Add version field&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TASK">TASK</span></span></h3>
<div class="outline-text-3" id="text-3-11">
<p>
Add <code>version</code> field to database record.
</p>
</div>
</div>
<div id="outline-container-sec-3-12" class="outline-3">
<h3 id="sec-3-12"><span class="section-number-3">3.12</span> <span class="done IN_PROGRESS">IN PROGRESS</span> Split view and BL in feature/check-target&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TASK">TASK</span></span></h3>
<div class="outline-text-3" id="text-3-12">
<p>
BL not allowed in view, should extact BL function from view files on frontend.
</p>
</div>
</div>
<div id="outline-container-sec-3-13" class="outline-3">
<h3 id="sec-3-13"><span class="section-number-3">3.13</span> Encode promo and target&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TASK">TASK</span></span></h3>
<div class="outline-text-3" id="text-3-13">
<ul class="org-ul">
<li>To correctly handler promos and targets need to encode them into some kind of URL format.
</li>
<li>Possibly create new pair of fields for encoded promo and target.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-3-14" class="outline-3">
<h3 id="sec-3-14"><span class="section-number-3">3.14</span> Authentification&#xa0;&#xa0;&#xa0;<span class="tag"><span class="FEATURE">FEATURE</span></span></h3>
<div class="outline-text-3" id="text-3-14">
<p>
Implement authentification by socail networks.
</p>
</div>
</div>
<div id="outline-container-sec-3-15" class="outline-3">
<h3 id="sec-3-15"><span class="section-number-3">3.15</span> Add switch(On/Off)At front implementation&#xa0;&#xa0;&#xa0;<span class="tag"><span class="FEATURE">FEATURE</span></span></h3>
<div class="outline-text-3" id="text-3-15">
<p>
Add some kind of input (like calendar) to allow users to change promo (target?) switch off date.
</p>
</div>
</div>
<div id="outline-container-sec-3-16" class="outline-3">
<h3 id="sec-3-16"><span class="section-number-3">3.16</span> Default target&#xa0;&#xa0;&#xa0;<span class="tag"><span class="FEATURE">FEATURE</span></span></h3>
<div class="outline-text-3" id="text-3-16">
<p>
User must create defaut target link on promo creating that will handle all 'unexpected' requests.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: U-кме\ку</p>
<p class="date">Created: 2016-02-17 Ср 13:21</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
